nathanlnw/TJ_TRUCK_LOCAL/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Device_808.c
/*
     Device_808.C       和808   协议相关的 I/O 管脚配置     
*/

#include <rtthread.h> 
#include <rthw.h>
#include "stm32f4xx.h"
#include "usart.h"
#include "board.h"
#include <serial.h>

#include  <stdlib.h>
#include  <stdio.h>
#include  <string.h>
#include "App_moduleConfig.h"


u8  HardWareVerion=0;   //   硬件版本检测 
//-----  WachDog related----
u8    wdg_reset_flag=0;    //  Task Idle Hook 相关
u32   TIM3_Timer_Counter=0; //  测试定时器计数器

//--------  电压检测 相关 ---------------------------------
AD_POWER  Power_AD; 


//  -------  渣土车相关--------------------------
TRUCK_USE    TRK_Related; //渣土车相关     



u32  IC2Value=0;   // 
u32  DutyCycle	= 0;



void  Truck_init(void)
{
     TRK_Related.abnormal_counter=0;
	 TRK_Related.door_open_state_counter=0; 
	 TRK_Related.door_close_state_counter=0; 
	 TRK_Related.State_Door=0;
	 TRK_Related.Work_state_enable=0;
}

void  TRK_Light_Ctrl(void)
{
   if(TRK_Related.Work_state_enable==1)
   {
       REDLIGHT_ON;
	   // 扩展 BIT 23
	   Car_Status[1]&=~0x80; 
   }
   else
   {
       //  扩展 BIT 23
   	   REDLIGHT_OFF;	   
	   Car_Status[1]|=0x80;   
	   
   }

}

void TRK_Work_Status_check_1s_once(void)
{
   if(DataLink_Status()&&(UDP_dataPacket_flag==2))
   {
      TRK_Related.abnormal_counter=0;
	  TRK_Related.Work_state_enable=1;  //工作正常
   }
   else
   {
      TRK_Related.abnormal_counter++;  
	  if(TRK_Related.abnormal_counter>300)	//
	  {
             TRK_Related.Work_state_enable=0;// 工作异常    
			 
	  }

   }	
}

void  TRK_Door_State_Check(void)
{
  //   NOTE:  (NearLight_StatusGet()) // PC1
  //  	 	DoorLight_StatusGet()) // PA1

  if(NearLight_StatusGet()||DoorLight_StatusGet())
  {  //  翻斗开
       // 1. 判断状态
       TRK_Related.door_open_state_counter++;
       if(TRK_Related.door_open_state_counter>20)//4*5*200ms   ----4s
       	{  
       	    if(TRK_Related.State_Door==0)
			 {	
			   TRK_Related.State_Door=1;   //翻斗开启 立即上报，位置信息
				 //  1.1  使能语音播报
				  if(GSM_PWR.GSM_power_over) 
                     TTS_play("后陡挡板开启");
				  //   1.2	使能状态位 
					 // 扩展 BIT 22
					 Car_Status[1]|=0x40; 
				     //报警状态 bit  16  是渣土车后斗挡板开启 add  on   13-11-27
				     Warn_Status[1]|=0x01;  

				 //  1.3  使能发送即时数据
                  Current_State=1;   //   使能发送标志位
				  PositionSD_Enable();
                  Current_UDP_sd=1;   // 使能发送操作执行
				 //---------------------------------- 
       	    }
       	}

	   //-------        


	   //---------------------------
	   TRK_Related.door_close_state_counter=0;// clear  close
  }
  else
  {  // 翻斗关
         TRK_Related.door_close_state_counter++;
       if(TRK_Related.door_close_state_counter>25) // 5*5*200ms   --5s
       	{  
       	   if(TRK_Related.State_Door==1)
			 {	
			   TRK_Related.State_Door=0;   //翻斗开启 立即上报，位置信息
				 //  1.1  使能语音播报
				 if(GSM_PWR.GSM_power_over)  
                     TTS_play("后陡挡板关闭"); 

                     //   1.2  使能状态位 
                  // 扩展 BIT 22
	              Car_Status[1]&=~0x40;  
				  //报警状态 bit  16  是渣土车后斗挡板开启 add  on   13-11-27
				  Warn_Status[1]&=~0x01;   
				  	 
				 
				 //  1.3  使能发送即时数据
				  Current_State=1;   //   使能发送标志位
				  PositionSD_Enable();
                  Current_UDP_sd=1;   // 使能发送操作执行
				 //------------------------------------
       	    }
       	     
	 
       	}
	   
     //----------------------------------------------     
     TRK_Related.door_open_state_counter=0;  // clear  open     
  } 

}


static  void  TRK_RedLight_init(void)
{
    GPIO_InitTypeDef        gpio_init;

    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);	 

    gpio_init.GPIO_Mode = GPIO_Mode_AF;
    gpio_init.GPIO_Speed = GPIO_Speed_100MHz; 
    gpio_init.GPIO_OType = GPIO_OType_PP;  
    gpio_init.GPIO_PuPd  = GPIO_PuPd_NOPULL; 	 

    // 		Out
	//------------------- PE7 -----------------------------
	gpio_init.GPIO_Pin	 = GPIO_Pin_7;				//------车门开关状态  0 有效  常态下为高   
	gpio_init.GPIO_Mode  = GPIO_Mode_OUT;   //如果只接刹车，那就用PE5当刹车监视 
	GPIO_Init(GPIOE, &gpio_init); 

	REDLIGHT_OFF; 
}

void light_on(u8 i)  
{
    if(i)
	{   
	     REDLIGHT_ON;
		 rt_kprintf("\r\n---------RedLight ON\r\n");
    }
	else
	{
		REDLIGHT_OFF;
        rt_kprintf("\r\n---------RedLight OFF\r\n");    
	}
}
FINSH_FUNCTION_EXPORT(light_on, light_on[1|0]);    





//------------  AD    电压相关  -------------------- 
void AD_PowerInit(void)
{
   Power_AD.ADC_ConvertedValue=0; //电池电压AD数值    
   Power_AD.AD_Volte=0;      // 采集到的实际电压数值
   Power_AD.Classify_Door=160;   //  区分大车小车类型，  >16V  大型车 <16V 小型车 
   Power_AD.LowWarn_Limit_Value=10;  //  欠压报警门限值      
}

u8  HardWareGet(void)   
{  //  获取硬件版本信息   
   // -----    硬件版本状态监测 init  ----------------------
   /*
	PA13	1	复用硬件版本判断
	PA14	1	复用硬件版本判断
	PB3       0	复用硬件版本判断
    */
   u8   Value=0;

     //-----------------------------------------------------------  
     if(GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_13))  // bit 2 
	 	   Value|=0x04;
	 else
	 	   Value&=~0x04;  
     //----------------------------------------------------------
	if(GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_14))  // bit 1
	 	   Value|=0x02;
	 else
	 	   Value&=~0x02;   
	//------------------------------------------------------------ 
	 if(GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_3)) // bit0 
	 	   Value|=0x01; 
	 else
	 	   Value&=~0x01;  
	 //------------------------------------------------------------
      rt_kprintf("\r\n  硬件版本读取: %2X",Value);      
     return Value;
}
//FINSH_FUNCTION_EXPORT(HardWareGet, HardWareGet); 


void WatchDog_Feed(void)
{
    if(wdg_reset_flag==0)
           IWDG_ReloadCounter();   
}

void  reset(void)
{
   IWDG_SetReload(0);
   IWDG->KR = 0x00001;  //not regular
  wdg_reset_flag=1; 
} 
FINSH_FUNCTION_EXPORT(reset, ststem reset);
void WatchDogInit(void)
{    
  /* IWDG timeout equal to 250 ms (the timeout may varies due to LSI frequency
     dispersion) */
  /* Enable write access to IWDG_PR and IWDG_RLR registers */
  IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable); 

  /* IWDG counter clock: LSI/32 */
    /*   prescaler            min/ms    max/ms
         4                        0.1             409.6
         8                        0.2             819.2
         16                      0.4             1638.4
         32                      0.8              3276.8
         64                      1.6              6553.5
         128                    3.2              13107.2
         256                    6.4              26214.4   
  */
  IWDG_SetPrescaler(IWDG_Prescaler_16);

  /* Set counter reload value to obtain 250ms IWDG TimeOut.
     Counter Reload Value = 250ms/IWDG counter clock period
                          = 250ms / (LSI/32)
                          = 0.25s / (LsiFreq/32)
                          = LsiFreq/(32 * 4)
                          = LsiFreq/128
   */
  IWDG_SetReload(0X4AAA);//(LsiFreq/128);

